In [6]:
import numpy as np
import pandas as pd

## Pandas

- python 으로 하는 excel
- datatpye()
- 1. Series <- numpy 1차원 vector
- 2. DataFrame <- series 여러개가 coulmn으로 이어서 만들어진 <- numpy matrix

## Series
* numpy array vector - index가 없다
* series <= numpy array vector + index
* pd.Series()

In [7]:
L = [1,2,3,4]
pd.Series(L)

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
s['c']

3

In [13]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [15]:
s[['c', 'd']]

c    10
d     4
dtype: int64

In [16]:
s > 5 # broadcasting > element wise operating

a    False
b    False
c     True
d    False
dtype: bool

In [17]:
s[s > 5] # boolean indexing

c    10
dtype: int64

In [18]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

array([ 1,  2, 10,  4], dtype=int64)

In [194]:
'a' in s.index

False

In [20]:
s

a     1
b     2
c    10
d     4
dtype: int64

In [21]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [23]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [24]:
s.index = ['가', '나', '다', '라']
s

가     1
나     2
다    10
라     4
dtype: int64

AttributeError: can't set attribute

## DataFrame
* series 가 column 단위로 붙어서 만들어진 matrix(series => dataframe)
* pd.DataFrame()

In [92]:
raw_data = {'first_name': ['json', np.nan, 'tina', 'jake', 'amy'],
           'last_name': ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age': [42, np.nan, 26, 24, 73],
           'pretestscore': [4, np.nan, np.nan, 2, 4],
            'postestscore': [25, np.nan, np.nan, 62, 72]
           }
raw_data

{'first_name': ['json', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 26, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [93]:
# dict key => columns
# dict value => columns 값

df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0       json    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  26.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

## 데이터를 가공할 때, 일반적 보편적처리 방식..

* column - 특징을 칼럼으로 잡는다.  예 - 학생 학년 ,이름, 주소, 성적...
* row - 개별 데이터 값  예 - 첫번째 학생, 두번째 학생...

* column - feature, 열
* row - data, 행

* 하나의 칼럼 - 하나의 series < np.array <원소가 동일한 데이터타입으로 구성..
* dataframe - series가 연결되 matrix

* 하나의 칼럼에는 동일한 타입의 데이터로 구성된다
* 칼럼 간에는 다른 데이터 타입의 칼럼들이 존재한다..

In [94]:
df.head(2)

  first_name last_name   age  pretestscore  postestscore
0       json    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [95]:
df['first_name']

0    json
1     NaN
2    tina
3    jake
4     amy
Name: first_name, dtype: object

In [96]:
df[['last_name', 'age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  26.0
3    milner  24.0
4    coozer  73.0

In [97]:
df.first_name

# 속성으로 칼럼을 접근하는 방식..
# 1. 칼럼이름에 space가 있으면 안됨
# 2. 칼럼을 수정할 때 주의가 필요..

0    json
1     NaN
2    tina
3    jake
4     amy
Name: first_name, dtype: object

In [98]:
# df['age'] = df['age'].apply(lambda x: x*10)

In [99]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [100]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'postestscore'], dtype='object')

In [101]:
df.values # array

array([['json', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 26.0, nan, nan],
       ['jake', 'milner', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

## row indexing

* df.loc[index name]
* df.iloc[index order number]

* loc[], iloc[] - row와 column을 동시에 선택할 수도 있다..

In [103]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [104]:
df.loc['d']

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [105]:
df.iloc[3]

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [106]:
df.iloc[3:]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [107]:
df.loc['d':]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [108]:
df.loc[['c', 'e']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  26.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [109]:
df.iloc[[2, 4]]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  26.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [110]:
df.loc['b': 'd']

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0

In [111]:
# loc[], iloc[] - row와 column을 동시에 선택할 수도 있다..

In [112]:
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [113]:
df.loc['c', 'last_name']

'ali'

In [114]:
df.iloc[2, 1]

'ali'

In [115]:
df.loc[['c', 'd'], 'first_name': 'age']

  first_name last_name   age
c       tina       ali  26.0
d       jake    milner  24.0

In [116]:
df.iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  26.0
d       jake    milner  24.0

In [117]:
df.loc['d', 'pretestscore'] = 100.0
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [122]:
df.loc[['c','d'], ['age', 'postestscore']]

    age  postestscore
c  26.0           NaN
d  24.0          62.0

In [123]:
df.iloc[[2,4], [2,4]]

    age  postestscore
c  26.0           NaN
e  73.0          72.0

In [124]:
df.loc["d":, "pretestscore":]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [125]:
df.iloc[3:, 3:]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [133]:
# loc[rew index, col index], iloc[row index, col index]
# - row와 column을 동시에 선택할 수도 있다..

In [134]:
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [135]:
df.iloc[1:5:2, :]

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0         100.0          62.0

In [136]:
# dataframe에 boolean indexing도 가능하다.. => row indexing: loc[]

In [138]:
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [141]:
df.loc[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [142]:
# 'last_ name'이 'ali'인 사람의 데이터를 출력하시오..

In [143]:
df.loc[df['last_name'] == 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  26.0           NaN           NaN

In [153]:
# 나이가 40 이상인 사람의 postestscore 평균 점수는 얼마인가?

In [154]:
np.mean(df.loc[df['age'] > 40]['postestscore'])

48.5

In [155]:
df

  first_name last_name   age  pretestscore  postestscore
a       json    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  26.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

## 새로운 칼럼 추가...

In [157]:
df['address'] = ['seoul', 'inchen', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name   age  pretestscore  postestscore  address
a       json    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN   inchen
c       tina       ali  26.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

## 칼럼명 수정

In [159]:
df

  first_name last_name   age  pretestscore  postestscore  address
a       json    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN   inchen
c       tina       ali  26.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [171]:
df.columns = ['fn', 'ln', 'age', 'pres', 'posts', 'add']
df

     fn      ln   age   pres  posts      add
a  json  miller  42.0    4.0   25.0    seoul
b   NaN     NaN   NaN    NaN    NaN   inchen
c  tina     ali  26.0    NaN    NaN  daejeon
d  jake  milner  24.0  100.0   62.0    pusan
e   amy  coozer  73.0    4.0   72.0  gwangju

In [172]:
df

     fn      ln   age   pres  posts      add
a  json  miller  42.0    4.0   25.0    seoul
b   NaN     NaN   NaN    NaN    NaN   inchen
c  tina     ali  26.0    NaN    NaN  daejeon
d  jake  milner  24.0  100.0   62.0    pusan
e   amy  coozer  73.0    4.0   72.0  gwangju

In [173]:
df.rename(columns = {'add': 'address'}, inplace=True)
df

     fn      ln   age   pres  posts  address
a  json  miller  42.0    4.0   25.0    seoul
b   NaN     NaN   NaN    NaN    NaN   inchen
c  tina     ali  26.0    NaN    NaN  daejeon
d  jake  milner  24.0  100.0   62.0    pusan
e   amy  coozer  73.0    4.0   72.0  gwangju

## column 또는 row를 삭제

In [177]:
df.drop('address', axis=1, inplace=True)

In [178]:
df

     fn      ln   age   pres  posts
a  json  miller  42.0    4.0   25.0
b   NaN     NaN   NaN    NaN    NaN
c  tina     ali  26.0    NaN    NaN
d  jake  milner  24.0  100.0   62.0
e   amy  coozer  73.0    4.0   72.0

In [179]:
df.drop('c', axis=0)

     fn      ln   age   pres  posts
a  json  miller  42.0    4.0   25.0
b   NaN     NaN   NaN    NaN    NaN
d  jake  milner  24.0  100.0   62.0
e   amy  coozer  73.0    4.0   72.0

In [180]:
df

     fn      ln   age   pres  posts
a  json  miller  42.0    4.0   25.0
b   NaN     NaN   NaN    NaN    NaN
c  tina     ali  26.0    NaN    NaN
d  jake  milner  24.0  100.0   62.0
e   amy  coozer  73.0    4.0   72.0

In [182]:
df.drop(['ln', 'pres'], axis=1)

     fn   age  posts
a  json  42.0   25.0
b   NaN   NaN    NaN
c  tina  26.0    NaN
d  jake  24.0   62.0
e   amy  73.0   72.0

In [183]:
df

     fn      ln   age   pres  posts
a  json  miller  42.0    4.0   25.0
b   NaN     NaN   NaN    NaN    NaN
c  tina     ali  26.0    NaN    NaN
d  jake  milner  24.0  100.0   62.0
e   amy  coozer  73.0    4.0   72.0